In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\Smartphone_Usage_Productivity_Dataset.csv")
df.head()

,User_ID,Age,Gender,Occupation,Device_Type,Daily_Phone_Hours,Social_Media_Hours,Work_Productivity_Score,Sleep_Hours,Stress_Level,App_Usage_Count,Caffeine_Intake_Cups,Weekend_Screen_Time_Hours
0,U1,58,Male,Professional,Android,1.3,6.7,6,8.8,4,42,1,8.7
1,U2,25,Male,Professional,Android,1.2,1.5,5,6.4,1,51,3,5.1
2,U3,19,Male,Student,iOS,5.3,5.7,5,9.0,4,14,5,6.3
3,U4,35,Female,Business Owner,iOS,5.8,2.5,2,5.7,3,36,6,12.8
4,U5,33,Male,Freelancer,Android,7.9,1.3,4,5.7,3,37,5,9.9

In [4]:
df.shape

(50000, 13)

In [5]:
df.columns

Index(['User_ID', 'Age', 'Gender', 'Occupation', 'Device_Type',
       'Daily_Phone_Hours', 'Social_Media_Hours', 'Work_Productivity_Score',
       'Sleep_Hours', 'Stress_Level', 'App_Usage_Count',
       'Caffeine_Intake_Cups', 'Weekend_Screen_Time_Hours'],
      dtype='object')

In [6]:
df.isnull().sum()

User_ID                      0
Age                          0
Gender                       0
Occupation                   0
Device_Type                  0
Daily_Phone_Hours            0
Social_Media_Hours           0
Work_Productivity_Score      0
Sleep_Hours                  0
Stress_Level                 0
App_Usage_Count              0
Caffeine_Intake_Cups         0
Weekend_Screen_Time_Hours    0
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   User_ID                    50000 non-null  object
 1   Age                        50000 non-null  int64
 2   Gender                     50000 non-null  object
 3   Occupation                 50000 non-null  object
 4   Device_Type                50000 non-null  object
 5   Daily_Phone_Hours          50000 non-null  float64
 6   Social_Media_Hours         50000 non-null  float64
 7   Work_Productivity_Score    50000 non-null  int64
 8   Sleep_Hours                50000 non-null  float64
 9   Stress_Level               50000 non-null  int64
 10  App_Usage_Count            50000 non-null  int64
 11  Caffeine_Intake_Cups       50000 non-null  int64
 12  Weekend_Screen_Time_Hours  50000 non-null  float64
dtypes: float64(4), int64(5), object(4)
memory usage: 5.0+ MB

In [8]:
pd.set_option('display.float_format', '{:.2f}'.format)

In [9]:
df.describe()

,Age,Daily_Phone_Hours,Social_Media_Hours,Work_Productivity_Score,Sleep_Hours,Stress_Level,App_Usage_Count,Caffeine_Intake_Cups,Weekend_Screen_Time_Hours
count,50000.00,50000.00,50000.00,50000.00,50000.00,50000.00,50000.00,50000.00,50000.00
mean,39.03,6.51,4.27,5.50,6.50,5.50,32.44,3.00,8.01
std,12.41,3.17,2.16,2.87,1.45,2.87,16.12,2.00,3.46
min,18.00,1.00,0.50,1.00,4.00,1.00,5.00,0.00,2.00
25%,28.00,3.80,2.40,3.00,5.20,3.00,18.00,1.00,5.00
50%,39.00,6.50,4.30,5.50,6.50,6.00,32.00,3.00,8.00
75%,50.00,9.20,6.10,8.00,7.80,8.00,46.00,5.00,11.00
max,60.00,12.00,8.00,10.00,9.00,10.00,60.00,6.00,14.00

In [10]:
df['Device_Type'].value_counts()

Device_Type
Android    25080
iOS        24920
Name: count, dtype: int64

In [11]:
df['Device_Type'].value_counts(normalize=True)              #gives percentage in a particular column

Device_Type
Android   0.50
iOS       0.50
Name: proportion, dtype: float64

In [12]:
df.isna().sum()

User_ID                      0
Age                          0
Gender                       0
Occupation                   0
Device_Type                  0
Daily_Phone_Hours            0
Social_Media_Hours           0
Work_Productivity_Score      0
Sleep_Hours                  0
Stress_Level                 0
App_Usage_Count              0
Caffeine_Intake_Cups         0
Weekend_Screen_Time_Hours    0
dtype: int64

Boolean conditioning

In [13]:
filter1 = df[(df['Gender'] == 'Female') & (df['Age'].between(20,25))][['Age','Social_Media_Hours']]
filter1.head(10)

     Age  Social_Media_Hours
9     23                1.10
12    20                5.60
48    25                1.50
50    23                6.00
58    22                7.90
63    23                7.70
65    24                1.80
78    22                3.00
94    20                4.30
126   25                3.70

using loc for conditioning

In [14]:
filter2 = df.loc[(df['Gender'] == 'Male') & (df['Age'].between(20,25)),['Age','Social_Media_Hours']]
filter2.head(10)

     Age  Social_Media_Hours
1     25                1.50
7     24                1.90
14    23                2.50
37    24                6.40
40    24                4.70
45    20                0.90
59    20                6.80
98    22                2.90
124   23                1.70
125   21                4.00

using query

In [15]:
filter3 = df.query("20 <= Age <= 25 and Device_Type == 'iOS'")[['Age','Gender','Social_Media_Hours']]
filter3.head(10)

    Age  Gender  Social_Media_Hours
7    24    Male                1.90
9    23  Female                1.10
12   20  Female                5.60
37   24    Male                6.40
40   24    Male                4.70
45   20    Male                0.90
48   25  Female                1.50
63   23  Female                7.70
65   24  Female                1.80
78   22  Female                3.00

using where

df.where(condition, other=value)

In [16]:
df.where(df['Age'] < 35)

,User_ID,Age,Gender,Occupation,Device_Type,Daily_Phone_Hours,Social_Media_Hours,Work_Productivity_Score,Sleep_Hours,Stress_Level,App_Usage_Count,Caffeine_Intake_Cups,Weekend_Screen_Time_Hours
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,U2,25.00,Male,Professional,Android,1.20,1.50,5.00,6.40,1.00,51.00,3.00,5.10
2,U3,19.00,Male,Student,iOS,5.30,5.70,5.00,9.00,4.00,14.00,5.00,6.30
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,U5,33.00,Male,Freelancer,Android,7.90,1.30,4.00,5.70,3.00,37.00,5.00,9.90
...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49996,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49997,U49998,27.00,Female,Freelancer,iOS,1.40,2.50,4.00,6.70,9.00,39.00,4.00,5.10
49998,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49999,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df['Age'].where(df['Age'] < 35)

0         NaN
1       25.00
2       19.00
3         NaN
4       33.00
         ...
49995     NaN
49996     NaN
49997   27.00
49998     NaN
49999     NaN
Name: Age, Length: 50000, dtype: float64

In [18]:
df.where(df['Age'] < 30, 0)

,User_ID,Age,Gender,Occupation,Device_Type,Daily_Phone_Hours,Social_Media_Hours,Work_Productivity_Score,Sleep_Hours,Stress_Level,App_Usage_Count,Caffeine_Intake_Cups,Weekend_Screen_Time_Hours
0,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
1,U2,25,Male,Professional,Android,1.20,1.50,5,6.40,1,51,3,5.10
2,U3,19,Male,Student,iOS,5.30,5.70,5,9.00,4,14,5,6.30
3,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
4,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
49996,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
49997,U49998,27,Female,Freelancer,iOS,1.40,2.50,4,6.70,9,39,4,5.10
49998,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00
49999,0,0,0,0,0,0.00,0.00,0,0.00,0,0,0,0.00

Reading tsv file

In [19]:
tsv_data = pd.read_table(r"C:\Users\Dell\Downloads\Datasets\Restaurant_Reviews.tsv")
tsv_data.head()

                                              Review  Liked
0                           Wow... Loved this place.      1
1                                 Crust is not good.      0
2          Not tasty and the texture was just nasty.      0
3  Stopped by during the late May bank holiday of...      1
4  The selection on the menu was great and so wer...      1

In [20]:
tsv_data = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets\Restaurant_Reviews.tsv",sep = '\t')
tsv_data.head()

                                              Review  Liked
0                           Wow... Loved this place.      1
1                                 Crust is not good.      0
2          Not tasty and the texture was just nasty.      0
3  Stopped by during the late May bank holiday of...      1
4  The selection on the menu was great and so wer...      1

Reading json file

In [21]:
jdf = pd.read_json(r"C:\Users\Dell\Downloads\Datasets\Movie_Stars.json")
jdf

                     Name Gender  Domestic Gross  Foreign Gross  Income
0          Angela Bassett      F              32             17    2.50
1           Jessica Lange      F              21             27    2.50
2            Winona Ryder      F              36             30    4.00
3       Michelle Pfeiffer      F              66             31   10.00
4         Whoopi Goldberg      F              32             33   10.00
..                    ...    ...             ...            ...     ...
61  Arnold Schwarzenegger      M             108            124   20.00
62              Brad Pitt      M              57            124   10.00
63        Michael Douglas      M              68            137   18.00
64         Robin Williams      M              92            180   15.00
65              Tom Hanks      M             166            182   17.50

[66 rows x 5 columns]

In [22]:
json_data = pd.read_json(r"C:\Users\Dell\Downloads\Datasets\PlantGrowth.json")     #file is double encoded
json_data.head()

                                                   0
0  [{"weight":4.17,"group":"ctrl"},{"weight":5.58...

In [23]:
import json

In [24]:
raw_text = open(r"C:\Users\Dell\Downloads\Datasets\PlantGrowth.json").read()
outer = json.loads(raw_text)
data = json.loads(outer[0])
json_data = pd.DataFrame(data)
json_data.head()

   weight group
0    4.17  ctrl
1    5.58  ctrl
2    5.18  ctrl
3    6.11  ctrl
4    4.50  ctrl

Reading excel file

In [25]:
edf = pd.read_excel(r"C:\Users\Dell\Downloads\Datasets\mini_telcom.xlsx")
edf.head()

   Gender  TT_gt_100    Response
0    male         y   not bought
1    male         n   not bought
2  female         n   not bought
3  female         n   not bought
4    male         n   not bought

Reading xml file

In [26]:
xml_data = pd.read_xml(r"C:\Users\Dell\Downloads\Datasets\country_data.xml")
xml_data

            name  rank  year   gdppc  neighbor
0  Liechtenstein     1  2008  141100       NaN
1      Singapore     4  2011   59900       NaN
2         Panama    68  2011   13600       NaN

reading txt file

In [27]:
dftxt = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets\Pen.txt",sep=' ')
dftxt.head()

,Item.ID,Item.Name,Item.Type,Brand,Price,UOM
1,121 001,"Parker Quink Roller Ball Pen Refill, Blue",Pen,Parker,69,Piece
2,121 002,Pilot V7 Liquid Ink Roller Ball Pen (2 Blue + ...,Pen,Pilot,135,Pack
3,121 003,Parker Beta Premium Gold Ball Pen,Pen,Parker,125,Piece
4,121 004,Pilot V5 Liquid Ink Roller Ball Pen - 1 Blue +...,Pen,Pilot,135,Pack
5,121 005,"Reynolds 045 Fine Carbure Blue Ballpen, Pack o...",Pen,Reynolds,60,Pack

In [28]:
dftxt.columns

Index(['Item.ID', 'Item.Name', 'Item.Type', 'Brand', 'Price', 'UOM'], dtype='object')

Datetime functions

In [29]:
data = pd.read_csv(r"C:\Users\Dell\Downloads\Datasets\sales-of-shampoo-over-a-three-ye.csv")
data.head()

        Month  Sales of shampoo over a three year period
0  2001-01-01                                     266.00
1  2001-02-01                                     145.90
2  2001-03-01                                     183.10
3  2001-04-01                                     119.30
4  2001-05-01                                     180.30

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 2 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Month                                      36 non-null     object
 1   Sales of shampoo over a three year period  36 non-null     float64
dtypes: float64(1), object(1)
memory usage: 708.0+ bytes

In [31]:
data['Month'] = pd.to_datetime(data['Month'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 2 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Month                                      36 non-null     datetime64[ns]
 1   Sales of shampoo over a three year period  36 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 708.0 bytes

In [32]:
data.head()

       Month  Sales of shampoo over a three year period
0 2001-01-01                                     266.00
1 2001-02-01                                     145.90
2 2001-03-01                                     183.10
3 2001-04-01                                     119.30
4 2001-05-01                                     180.30

In [33]:
data['Month'].dt.day_name().head()

0      Monday
1    Thursday
2    Thursday
3      Sunday
4     Tuesday
Name: Month, dtype: object

In [34]:
data['Month'].dt.year.head()         #dt.month,dt.day

0    2001
1    2001
2    2001
3    2001
4    2001
Name: Month, dtype: int32

In [35]:
data['Month'].dt.isocalendar().week.head(5)

0     1
1     5
2     9
3    13
4    18
Name: week, dtype: UInt32

In [36]:
data['Month'][0] + pd.Timedelta(days = 7)

Timestamp('2001-01-08 00:00:00')

In [37]:
(data['Month'][1] - data['Month'][0]).days             #.dt.days works on a Series of timedeltas, not a single Timedelta object.
                                                       #So you should use .days directly, not .dt.days

31

In [38]:
data['Month'].diff().dt.days.head()                #.diff() → difference between consecutive rows (Series of timedeltas)

0     NaN
1   31.00
2   28.00
3   31.00
4   30.00
Name: Month, dtype: float64

Creating date ranges

In [39]:
pd.date_range(start = '2026-02-24',end = '2026-03-05',freq='MS')             #MS - month start, ME- month end

DatetimeIndex(['2026-03-01'], dtype='datetime64[ns]', freq='MS')

In [40]:
pd.date_range(start = '2026-02-24',end = '2026-03-05',freq='D')

DatetimeIndex(['2026-02-24', '2026-02-25', '2026-02-26', '2026-02-27',
               '2026-02-28', '2026-03-01', '2026-03-02', '2026-03-03',
               '2026-03-04', '2026-03-05'],
              dtype='datetime64[ns]', freq='D')

In [41]:
data['Month'].isna().sum()

np.int64(0)

Aggreagation

In [42]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\solar.csv")
df.head()

,State,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
0,California,289,4395,15.30,10826,West
1,Arizona,48,1078,22.50,2550,West
2,Nevada,11,238,21.60,557,West
3,Chicago,33,261,7.90,590,North
4,Connecticut,20,118,5.90,235,East

In [43]:
df.shape

(8, 6)

In [44]:
df.aggregate({'Number of Solar Plants':'sum','Installed Capacity (MW)':'mean'})       #or agg

Number of Solar Plants    441.00
Installed Capacity (MW)   858.12
dtype: float64

In [45]:
df.agg({'Average MW Per Plant': ['min','max']})

     Average MW Per Plant
min                  4.10
max                 22.50

In [46]:
df['Average MW Per Plant'].agg(['min','max'])

min    4.10
max   22.50
Name: Average MW Per Plant, dtype: float64

In [47]:
df[['Average MW Per Plant']].sum()      #or df['Average MW Per Plant'].mean()

Average MW Per Plant   105.20
dtype: float64

In [48]:
df.describe()

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh)
count,8.00,8.00,8.00,8.00
mean,55.12,858.12,13.15,1956.12
std,95.37,1466.28,6.89,3667.32
min,11.00,53.00,4.10,84.00
25%,12.75,169.75,7.40,324.25
50%,17.50,249.50,13.80,505.00
75%,36.75,670.75,17.10,1080.00
max,289.00,4395.00,22.50,10826.00

In [49]:
df.groupby('Region')

In [50]:
df.groupby('Region')['Number of Solar Plants'].agg(['min','max'])

        min  max
Region
East     13   20
North    33   33
South    12   15
West     11  289

In [51]:
region_grouped = df.groupby('Region')

In [52]:
region_grouped['Installed Capacity (MW)'].sum()

Region
East      171
North     261
South     722
West     5711
Name: Installed Capacity (MW), dtype: int64

In [53]:
region_grouped.get_group('West')['Installed Capacity (MW)'].agg(['min','max'])

min     238
max    4395
Name: Installed Capacity (MW), dtype: int64

custom aggregate function

In [54]:
region_grouped['Installed Capacity (MW)'].apply(lambda x : max(x) - min(x))

Region
East       65
North       0
South     348
West     4157
Name: Installed Capacity (MW), dtype: int64

In [55]:
region_grouped['Installed Capacity (MW)'].agg(lambda x: x.max() - x.min())

Region
East       65
North       0
South     348
West     4157
Name: Installed Capacity (MW), dtype: int64

In [56]:
transform_ = df.groupby('Region')['Number of Solar Plants'].transform('mean')         #Adds group average to each row
transform_                                                                            #Output length = original DataFrame

0   116.00
1   116.00
2   116.00
3    33.00
4    16.50
5    13.50
6    16.50
7    13.50
Name: Number of Solar Plants, dtype: float64

Pivot table

In [57]:
pd.pivot_table(
    df,
    values='Number of Solar Plants',
    index='Region',
    columns='State',
    aggfunc='mean',
    margins =True,
    fill_value = 0
)

State,Arizona,California,Chicago,Connecticut,Florida,Nevada,New York,Texas,All
Region,,,,,,,,,
East,0.00,0.00,0.00,20.00,0.00,0.00,13.00,0.00,16.50
North,0.00,0.00,33.00,0.00,0.00,0.00,0.00,0.00,33.00
South,0.00,0.00,0.00,0.00,15.00,0.00,0.00,12.00,13.50
West,48.00,289.00,0.00,0.00,0.00,11.00,0.00,0.00,116.00
All,48.00,289.00,33.00,20.00,15.00,11.00,13.00,12.00,55.12

Merging and Joining

In [103]:
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'score': [85, 90, 95, 80]
})
df1

   id     name  score
0   1    Alice     85
1   2      Bob     90
2   3  Charlie     95
3   4    David     80

In [104]:
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'name': ['Charlie', 'David', 'Eve', 'Frank'],
    'score': [100, 88, 92, 75]
})
df2

   id     name  score
0   3  Charlie    100
1   4    David     88
2   5      Eve     92
3   6    Frank     75

merge()

In [71]:
pd.merge(df1,df2, on = 'id')

   id   name_x  score_x   name_y  score_y
0   3  Charlie       95  Charlie      100
1   4    David       80    David       88

In [72]:
pd.merge(df1,df2, on = 'id', suffixes=('_df1','_df2'))

   id name_df1  score_df1 name_df2  score_df2
0   3  Charlie         95  Charlie        100
1   4    David         80    David         88

In [73]:
pd.merge(df1,df2, on = 'id', how = 'left',suffixes=('_df1','_df2'))

   id name_df1  score_df1 name_df2  score_df2
0   1    Alice         85      NaN        NaN
1   2      Bob         90      NaN        NaN
2   3  Charlie         95  Charlie     100.00
3   4    David         80    David      88.00

In [79]:
pd.merge(df1,df2, on = ['id','name'],how = 'left',suffixes=('_df1','_df2'))     #joining on two columns

   id     name  score_df1  score_df2
0   1    Alice         85        NaN
1   2      Bob         90        NaN
2   3  Charlie         95     100.00
3   4    David         80      88.00

In [74]:
df3 = pd.DataFrame({
    '_id': [3, 4, 5, 6],
    'name': ['Charlie', 'David', 'Eve', 'Frank'],
    'score': [100, 88, 92, 75]
})
df3

   _id     name  score
0    3  Charlie    100
1    4    David     88
2    5      Eve     92
3    6    Frank     75

In [76]:
pd.merge(df1,df3, left_on='id', right_on = '_id',suffixes=('_df1','_df3'))        #when key columns of data frames have different names

   id name_df1  score_df1  _id name_df3  score_df3
0   3  Charlie         95    3  Charlie        100
1   4    David         80    4    David         88

join()  - use it when you want to join on index

In [105]:
df1.join(df2,lsuffix='_df1',rsuffix='_df2',on = 'id')

   id  id_df1 name_df1  score_df1  id_df2 name_df2  score_df2
0   1       1    Alice         85    4.00    David      88.00
1   2       2      Bob         90    5.00      Eve      92.00
2   3       3  Charlie         95    6.00    Frank      75.00
3   4       4    David         80     NaN      NaN        NaN

In [106]:
df1.set_index('id',inplace =True)
df2.set_index('id',inplace =True)

In [107]:
df1.join(df2,lsuffix='_df1',rsuffix='_df2')      #joining on index and by default its left join

   name_df1  score_df1 name_df2  score_df2
id
1     Alice         85      NaN        NaN
2       Bob         90      NaN        NaN
3   Charlie         95  Charlie     100.00
4     David         80    David      88.00

In [108]:
df1.join(df2,lsuffix='_df1',rsuffix='_df2', how='inner')

   name_df1  score_df1 name_df2  score_df2
id
3   Charlie         95  Charlie        100
4     David         80    David         88

concat()

In [126]:
df1 = pd.DataFrame({
    'emp_id': [101, 102, 103, 104],
    'name': ['John', 'Jane', 'Mike', 'Sara'],
    'department': ['HR', 'Finance', 'IT', 'Marketing']
})
df1

   emp_id  name department
0     101  John         HR
1     102  Jane    Finance
2     103  Mike         IT
3     104  Sara  Marketing

In [110]:
df2 = pd.DataFrame({
    'employee_id': [102, 103, 104, 105],
    'salary': [70000, 80000, 75000, 90000],
    'bonus': [5000, 6000, 5500, 7000]
})
df2

   employee_id  salary  bonus
0          102   70000   5000
1          103   80000   6000
2          104   75000   5500
3          105   90000   7000

In [118]:
df_concat = pd.concat([df1,df2],ignore_index = False)      #by deafult its row wise
df_concat

   emp_id  name department  employee_id   salary   bonus
0  101.00  John         HR          NaN      NaN     NaN
1  102.00  Jane    Finance          NaN      NaN     NaN
2  103.00  Mike         IT          NaN      NaN     NaN
3  104.00  Sara  Marketing          NaN      NaN     NaN
0     NaN   NaN        NaN       102.00 70000.00 5000.00
1     NaN   NaN        NaN       103.00 80000.00 6000.00
2     NaN   NaN        NaN       104.00 75000.00 5500.00
3     NaN   NaN        NaN       105.00 90000.00 7000.00

In [132]:
new_row = {'emp_id' : 105, 'name' : 'Tom', 'department' : 'IT'}
pd.concat([df1,pd.DataFrame([new_row])],ignore_index=False)

   emp_id  name department
0     101  John         HR
1     102  Jane    Finance
2     103  Mike         IT
3     104  Sara  Marketing
0     105   Tom         IT

In [141]:
new_row = {'emp_id' : 105, 'name' : 'Tom', 'department' : 'IT'}
pd.concat([df1,pd.DataFrame([new_row])],ignore_index=True,sort = True)

  department  emp_id  name
0         HR     101  John
1    Finance     102  Jane
2         IT     103  Mike
3  Marketing     104  Sara
4         IT     105   Tom

In [145]:
df_concat = pd.concat([df1,df2],axis =1)          #column wise
df_concat

   emp_id  name department  employee_id  salary  bonus
0     101  John         HR          102   70000   5000
1     102  Jane    Finance          103   80000   6000
2     103  Mike         IT          104   75000   5500
3     104  Sara  Marketing          105   90000   7000

Adding a column

In [152]:
emails = ['john@gmail.com','jane1@yahoo.com','mikey@gmail.com','sara@hotmail.com']
df1['email'] = emails
df1

   emp_id  name department             email
0     101  John         HR    john@gmail.com
1     102  Jane    Finance   jane1@yahoo.com
2     103  Mike         IT   mikey@gmail.com
3     104  Sara  Marketing  sara@hotmail.com

In [155]:
df1.drop('email',axis = 1,inplace = True)
df1

   emp_id  name department
0     101  John         HR
1     102  Jane    Finance
2     103  Mike         IT
3     104  Sara  Marketing

In [157]:
df1 = df1.drop(index = 2)
df1

   emp_id  name department
0     101  John         HR
1     102  Jane    Finance
3     104  Sara  Marketing

In [160]:
df1['name'].str.upper()

0    JOHN
1    JANE
3    SARA
Name: name, dtype: object

In [162]:
df1.apply(len)      #column wise

emp_id        3
name          3
department    3
dtype: int64

In [163]:
df1.apply(len,axis=1)     #row wise

0    3
1    3
3    3
dtype: int64